let charData = {
    profession_list: ['近卫', '狙击', '先锋', '医疗', '术师', '特种', '重装', '辅助'],

    valid_tags: ['特种干员', '近战位', '输出', '生存', '近卫干员', '支援', '支援机械', '狙击干员', '远程位', '位移', '减速', '术师干员', '新手', '先锋干员',
        '费用回复', '群攻', '医疗干员', '治疗', '控场', '快速复活', '重装干员', '防护', '爆发', '辅助干员', '削弱', '召唤', '高级资深干员', '资深干员'],

    replace_tag_keywords: {
        '近卫': '近卫干员',
        '重装': '重装干员',
        '辅助': '辅助干员',
        '狙击': '狙击干员',
        '先锋': '先锋干员',
        '术师': '术师干员',
        '术士': '术师干员',
        '特种': '特种干员',
        '医疗': '医疗干员',
        '近战': '近战位',
        '远程': '远程位',
        '高资': '高级资深干员',
        '资深': '资深干员',
        '高级资深': '高级资深干员',
        '机械': '支援机械',
        '快活': '快速复活',
        '回费': '费用回复',
    },

    profession_map: {
        '近卫': 'WARRIOR',
        '重装': 'TANK',
        '辅助': 'SUPPORT',
        '狙击': 'SNIPER',
        '先锋': 'PIONEER',
        '术师': 'CASTER',
        '特种': 'SPECIAL',
        '医疗': 'MEDIC',
    },

}

export default {
    charData,
}